app/Livewire/CryptoList.php

    public function render(CryptoApiRepositoryInterface $cryptoRepository)
    {
        $this->cryptoRepository = $cryptoRepository;
        $responsedcoins = $this->cryptoRepository->listLatestCoins('market_cap', 'coins');
        $userCoins = Auth::user()->cryptos->pluck('symbol')->toArray();

        // Filter out coins that are already in the user's list
        $this->coins = collect($responsedcoins)->filter(function ($coin) use ($userCoins) {
            return !in_array($coin['symbol'], $userCoins);
        })->map(function ($coin) {
            return ['label' => $coin['name'], 'value' => $coin['symbol']];
        });
---
select * from `cryptos` where `cryptos`.`user_id` = 1 and `cryptos`.`user_id` is not null